Model: "negative_particles.h5"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_21 (Dense)            (None, 40)                200       
                                                                 
 dense_22 (Dense)            (None, 40)                1640      
                                                                 
 dense_23 (Dense)            (None, 80)                3280      
                                                                 
 dense_24 (Dense)            (None, 80)                6480      
                                                                 
 dense_25 (Dense)            (None, 40)                3240      
                                                                 
 dense_26 (Dense)            (None, 40)                1640      
                                                                 
 dense_27 (Dense)            (None, 1)                 41        
                                                                 
=================================================================
Total params: 16521 (64.54 KB)
Trainable params: 16521 (64.54 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
