Model: "correction_mass_test-11-6-2023-8L-100-16.h5"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_14 (Dense)            (None, 40)                200       
                                                                 
 dense_15 (Dense)            (None, 40)                1640      
                                                                 
 dense_16 (Dense)            (None, 80)                3280      
                                                                 
 dense_17 (Dense)            (None, 80)                6480      
                                                                 
 dense_18 (Dense)            (None, 40)                3240      
                                                                 
 dense_19 (Dense)            (None, 40)                1640      
                                                                 
 dense_20 (Dense)            (None, 1)                 41        
                                                                 
=================================================================
Total params: 16521 (64.54 KB)
Trainable params: 16521 (64.54 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
