Model: "correction_mass_test-11-6-2023-8L-50-16.h5"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_28 (Dense)            (None, 40)                200       
                                                                 
 dense_29 (Dense)            (None, 40)                1640      
                                                                 
 dense_30 (Dense)            (None, 80)                3280      
                                                                 
 dense_31 (Dense)            (None, 80)                6480      
                                                                 
 dense_32 (Dense)            (None, 40)                3240      
                                                                 
 dense_33 (Dense)            (None, 40)                1640      
                                                                 
 dense_34 (Dense)            (None, 1)                 41        
                                                                 
=================================================================
Total params: 16521 (64.54 KB)
Trainable params: 16521 (64.54 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
